GB / Олег Гладкий / https://gb.ru/users/3837199

# Урок 2 

Вычисления с помощью `Numpy`. Работа с данными в `Pandas`.

## Вычисления с помощью Numpy

### Задание N–1 (numpy)
Импортируйте библиотеку `Numpy` и дайте ей псевдоним `np`.

Создайте массив `Numpy` под названием $a$ размером $5×2$, то есть состоящий из $5$ строк и $2$ столбцов. Первый столбец должен содержать числа $1, 2, 3, 3, 1$, а второй — числа $6, 8, 11, 10, 7$. Будем считать, что каждый столбец — это признак, а строка — наблюдение. Затем найдите среднее значение по каждому признаку, используя метод `mean` массива `Numpy`. Результат запишите в массив $mean\_a$, в нем должно быть 2 элемента.

In [1]:
import numpy as np

In [2]:
a = [[1, 2, 3, 3, 1], [6, 8, 11, 10, 7]]
a = np.array(a)
a = a.transpose()
a

array([[ 1,  6],
       [ 2,  8],
       [ 3, 11],
       [ 3, 10],
       [ 1,  7]])

In [3]:
mean_a = a.mean(axis=0)
mean_a

array([2. , 8.4])

### Задание N–2 (numpy) 
Вычислите массив $a\_centered$, отняв от значений массива $a$ средние значения соответствующих признаков, содержащиеся в массиве $mean\_a$. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер $5×2$.

In [5]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

### Задание N–3 (numpy)

Найдите скалярное произведение столбцов массива $a\_centered$. В результате должна получиться величина $a\_centered\_sp$. Затем поделите $a\_centered\_sp$ на $N-1$, где $N$ — число наблюдений.

In [30]:
a_centered_sp = np.dot(a_centered[:, 0], a_centered[:, 1])
a_centered_sp = a_centered_sp / (a[:, 0].size - 1)
a_centered_sp

2.0

### Задание N–4 * (numpy)

В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом — с помощью функции `np.cov`. В качестве аргумента $m$ функция `np.cov` должна принимать транспонированный массив $a$. В получившейся ковариационной матрице (массив `Numpy` размером $2×2$) искомое значение ковариации будет равно элементу в строке с индексом $0$ и столбце с индексом $1$.

In [36]:
covar_matrix_a = np.cov(a.T)
covar_matrix_a

array([[1. , 2. ],
       [2. , 4.3]])

In [51]:
a_covar = covar_matrix_a[0, 1].copy()
a_covar

2.0

## Работа с данными в Pandas

### Задание P–1 (pandas)

Импортируйте библиотеку `Pandas` и дайте ей псевдоним `pd`. Создайте датафрейм `authors` со столбцами `author_id` и `author_name`, в которых соответственно содержатся данные: 
* [1, 2, 3]
* ['Тургенев', 'Чехов', 'Островский']

Затем создайте датафрейм `book` cо столбцами `author_id`, `book_title` и `price`, в которых соответственно содержатся данные: 
* [1, 1, 1, 2, 2, 3, 3] 
* ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
* [450, 300, 350, 500, 450, 370, 290]

In [55]:
import pandas as pd

In [60]:
authors = pd.DataFrame(
    {
        'author_id': [1, 2, 3],
        'author_name': ['Тургенев', 'Чехов', 'Островский']
    }
)
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [82]:
book = pd.DataFrame(
    {
        'author_id': [1, 1, 1, 2, 2, 3, 3],
        'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                      'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
        'price':[450, 300, 350, 500, 450, 370, 290]
    }
)
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание P–2 (pandas)

Получите датафрейм `authors_price`, соединив датафреймы `authors` и `books` по полю `author_id`.

In [83]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание P–3 (pandas)¶

Создайте датафрейм `top5`, в котором содержатся строки из `authors_price` с пятью самыми дорогими книгами.

In [93]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Задание P–4 (pandas)¶

Создайте датафрейм `authors_stat` на основе информации из `authors_price`. В датафрейме `authors_stat` должны быть четыре столбца: 
* `author_name`, `min_price`, `max_price` и `mean_price`, 

в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [94]:
authors_stat = authors_price.groupby('author_name').agg({'price':["min", "max", "mean"]})
authors_stat

            price
              min  max        mean
author_name
Островский    290  370  330.000000
Тургенев      300  450  366.666667
Чехов         450  500  475.000000